openfoam_cases/sthx_chtMultiRegionSimpleFoam/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    shell_inlet
    {
        type            patch;
        nFaces          6;
        startFace       86897;
    }
    shell_outlet
    {
        type            patch;
        nFaces          6;
        startFace       86903;
    }
    tube_inlets
    {
        type            patch;
        nFaces          91;
        startFace       86909;
    }
    tube_outlets
    {
        type            patch;
        nFaces          91;
        startFace       87000;
    }
    defaultFaces
    {
        type            patch;
        nFaces          1588;
        startFace       87091;
    }
)

// ************************************************************************* //
