openfoam_cases/sthx_chtMultiRegionSimpleFoam/constant/shell_side_fluid/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/shell_side_fluid/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    shell_inlet
    {
        type            patch;
        nFaces          6;
        startFace       58205;
    }
    shell_outlet
    {
        type            patch;
        nFaces          6;
        startFace       58211;
    }
    defaultFaces
    {
        type            patch;
        nFaces          1336;
        startFace       58217;
    }
    shell_side_fluid_to_tube_side_fluid
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          6606;
        startFace       59553;
        sampleMode      nearestPatchFace;
        sampleRegion    tube_side_fluid;
        samplePatch     tube_side_fluid_to_shell_side_fluid;
    }
)

// ************************************************************************* //
