openfoam_cases/sthx_chtMultiRegionSimpleFoam/constant/tube_side_fluid/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/tube_side_fluid/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    tube_inlets
    {
        type            patch;
        nFaces          91;
        startFace       22086;
    }
    tube_outlets
    {
        type            patch;
        nFaces          91;
        startFace       22177;
    }
    defaultFaces
    {
        type            patch;
        nFaces          252;
        startFace       22268;
    }
    tube_side_fluid_to_shell_side_fluid
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          6606;
        startFace       22520;
        sampleMode      nearestPatchFace;
        sampleRegion    shell_side_fluid;
        samplePatch     shell_side_fluid_to_tube_side_fluid;
    }
)

// ************************************************************************* //
