openfoam_cases/sthx_chtMultiRegionSimpleFoam/constant/regionProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      regionProperties;
}

regions
(
    fluid   (shell_side_fluid tube_side_fluid)
    solid   ()
);
