openfoam_cases/sthx_chtMultiRegionSimpleFoam/constant/shell_side_fluid/fvOptions
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvOptions;
}

{}
