openfoam_cases/sthx_chtMultiRegionSimpleFoam/constant/tube_side_fluid/radiationProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      radiationProperties;
}

radiation       off;
radiationModel  none;
