openfoam_cases/sthx_chtMultiRegionSimpleFoam/0.orig/shell_side_fluid/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (0 0 0);

boundaryField
{
    shell_inlet
    {
        type            fixedValue;
        value           uniform (0 0 -1);
    }

    shell_outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }

    outer_wall
    {
        type            noSlip;
    }

    ".*_to_.*"
    {
        type            noSlip;
    }

    defaultFaces
    {
        type            noSlip;
    }
}
