openfoam_cases/sthx_chtMultiRegionSimpleFoam/0.orig/tube_side_fluid/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (1 0 0);

boundaryField
{
    tube_inlets
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }

    tube_outlets
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }

    ".*_to_.*"
    {
        type            noSlip;
    }

    defaultFaces
    {
        type            noSlip;
    }
}
