openfoam_cases/sthx_chtMultiRegionSimpleFoam/0.orig/shell_side_fluid/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}

dimensions      [1 -1 -2 0 0 0 0];
internalField   uniform 100000;

boundaryField
{
    shell_inlet  { type calculated; value uniform 100000; }
    shell_outlet { type calculated; value uniform 100000; }
    outer_wall   { type calculated; value uniform 100000; }
    ".*_to_.*"  { type calculated; value uniform 100000; }
    defaultFaces { type calculated; value uniform 100000; }
}
