openfoam_cases/sthx_chtMultiRegionSimpleFoam/0.orig/tube_side_fluid/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}

dimensions      [1 -1 -2 0 0 0 0];
internalField   uniform 100000;

boundaryField
{
    tube_inlets  { type calculated; value uniform 100000; }
    tube_outlets { type calculated; value uniform 100000; }
    ".*_to_.*"  { type calculated; value uniform 100000; }
    defaultFaces { type calculated; value uniform 100000; }
}
