openfoam_cases/sthx_chtMultiRegionSimpleFoam/0.orig/tube_side_fluid/p_rgh
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}

dimensions      [1 -1 -2 0 0 0 0];
internalField   uniform 100000;

boundaryField
{
    tube_inlets
    {
        type            fixedFluxPressure;
    }

    tube_outlets
    {
        type            fixedValue;
        value           uniform 100000;
    }

    ".*_to_.*"
    {
        type            fixedFluxPressure;
    }

    defaultFaces
    {
        type            fixedFluxPressure;
    }
}
