openfoam_cases/sthx_chtMultiRegionSimpleFoam/0.orig/shell_side_fluid/T
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}

dimensions      [0 0 0 1 0 0 0];
internalField   uniform 340;

boundaryField
{
    shell_inlet
    {
        type            fixedValue;
        value           uniform 360;
    }

    shell_outlet
    {
        type            inletOutlet;
        inletValue      uniform 340;
        value           uniform 340;
    }

    outer_wall
    {
        type            zeroGradient;
    }

    ".*_to_.*"
    {
        type            compressible::turbulentTemperatureCoupledBaffleMixed;
        Tnbr            T;
        kappaMethod     fluidThermo;
        value           uniform 340;
    }

    defaultFaces
    {
        type            zeroGradient;
    }
}
