openfoam_cases/sthx_chtMultiRegionSimpleFoam/0.orig/shell_side_fluid/alphat
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alphat;
}

dimensions      [1 -1 -1 0 0 0 0];
internalField   uniform 0;

boundaryField
{
    shell_inlet  { type calculated; value uniform 0; }
    shell_outlet { type calculated; value uniform 0; }
    outer_wall   { type compressible::alphatWallFunction; value uniform 0; }
    ".*_to_.*"  { type compressible::alphatWallFunction; value uniform 0; }
    defaultFaces { type calculated; value uniform 0; }
}
