openfoam_cases/sthx_chtMultiRegionSimpleFoam/0.orig/shell_side_fluid/nut
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}

dimensions      [0 2 -1 0 0 0 0];
internalField   uniform 0;

boundaryField
{
    shell_inlet  { type calculated; value uniform 0; }
    shell_outlet { type calculated; value uniform 0; }
    outer_wall   { type nutkWallFunction; value uniform 0; }
    ".*_to_.*"  { type nutkWallFunction; value uniform 0; }
    defaultFaces { type calculated; value uniform 0; }
}
