openfoam_cases/sthx_chtMultiRegionSimpleFoam/0.orig/tube_side_fluid/T
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}

dimensions      [0 0 0 1 0 0 0];
internalField   uniform 300;

boundaryField
{
    tube_inlets
    {
        type            fixedValue;
        value           uniform 300;
    }

    tube_outlets
    {
        type            inletOutlet;
        inletValue      uniform 300;
        value           uniform 300;
    }

    ".*_to_.*"
    {
        type            compressible::turbulentTemperatureCoupledBaffleMixed;
        Tnbr            T;
        kappaMethod     fluidThermo;
        value           uniform 300;
    }

    defaultFaces
    {
        type            zeroGradient;
    }
}
