openfoam_cases/sthx_chtMultiRegionSimpleFoam/0.orig/tube_side_fluid/alphat
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alphat;
}

dimensions      [1 -1 -1 0 0 0 0];
internalField   uniform 0;

boundaryField
{
    tube_inlets  { type calculated; value uniform 0; }
    tube_outlets { type calculated; value uniform 0; }
    ".*_to_.*"  { type compressible::alphatWallFunction; value uniform 0; }
    defaultFaces { type calculated; value uniform 0; }
}
