openfoam_cases/sthx_chtMultiRegionSimpleFoam/0.orig/tube_side_fluid/k
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0.01;

boundaryField
{
    tube_inlets  { type fixedValue; value uniform 0.01; }
    tube_outlets { type zeroGradient; }
    ".*_to_.*"  { type kqRWallFunction; value uniform 0.01; }
    defaultFaces { type zeroGradient; }
}
